src/mp_toir/Documents/мп_РегистрацияПроверокОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>мп_РегистрацияПроверокОборудования</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_ИсточникиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Проверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УзелОбъектаЭксплуатации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мп_ВидыПроверокОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Enums/мп_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_СтатусыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Documents/мп_РегистрацияПроверокОборудования/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ИменаСтраниц;

&НаКлиенте
Перем ТекущийИндексСтраницы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИменаСтраниц = Новый Массив;
	ИменаСтраниц.Добавить("ГруппаПроверки");
	ИменаСтраниц.Добавить("ГруппаОсновная");
	
	ЭтотОбъект.КоличествоСтраниц = ИменаСтраниц.Количество() - 1;

	ТекущийИндексСтраницы = 0;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустая() Тогда

		РеквизитыКонстант = ОбщегоНазначенияСервер.ПолучитьЗначенияКонстант();
		Объект.Организация = РеквизитыКонстант["ОрганизацияПользователя"];
		Объект.Подразделение = РеквизитыКонстант["ПодразделениеПользователя"];
		Объект.Ответственный = РеквизитыКонстант["ТекущийПользователь"];
		Объект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.Создан;

	Иначе

		ТолькоПросмотр = 
			Не ОбщегоНазначенияВызовСервера.РедактированиеФормыДокументаТОиР(
				Объект.Подразделение, Объект.Ответственный, Объект.СтатусОбмена);
			
		ЭтотОбъект.ТолькоПросмотр = ТолькоПросмотр;

	КонецЕсли;

	ЧтениеНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ЧтениеНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЧтениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "Документ.мп_РегистрацияПроверокОборудования.Форма.ФормаСтрокиПроверки" Тогда

		ДанныеСтроки = Объект.Проверки.НайтиПоИдентификатору(ИсточникВыбора.НомерСтроки);
		Если ИсточникВыбора.СохранитьИзменения Тогда
			
			Модифицированность = Истина;
			
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ИсточникВыбора);
			ДанныеСтроки.ЭтоНоваяСтрока = Ложь;
			ЧтениеНаСервере();
		ИначеЕсли ДанныеСтроки.ЭтоНоваяСтрока Тогда
			
			НомерСтроки = Объект.Проверки.Количество();
			Объект.Проверки.Удалить(НомерСтроки - 1);
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ТекущийИндексСтраницы = ИменаСтраниц.Найти(ТекущаяСтраница.Имя);
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПроверки

&НаКлиенте
Процедура ПроверкиПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПроверкиТехнологическоеМестоПриИзменении(Элемент)
	
	//ОбъектЭксплуатации = ОбщегоНазначенияВызовСервера.ОбъектыЭксплуатацииПоТехМесту(
	//	ЭтотОбъект.Элементы.Проверки.ТекущиеДанные.ТехнологическоеМесто, Истина);
	//
	//Если ТипЗнч(ОбъектЭксплуатации) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
	//	ЭтотОбъект.Элементы.Проверки.ТекущиеДанные.ОбъектЭксплуатации = ОбъектЭксплуатации;
	//Иначе
	//	ЭтотОбъект.Элементы.Проверки.ТекущиеДанные.ОбъектЭксплуатации =
	//		ПредопределенноеЗначение("Справочник.ОбъектыЭксплуатации.ПустаяСсылка");
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Страница1(Команда)
	НовыйИндекс = Макс(ТекущийИндексСтраницы - 1, 0);
	ТекущийИндексСтраницы = НовыйИндекс;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

&НаКлиенте
Процедура Страница2(Команда)
	НовыйИндекс = Мин(ТекущийИндексСтраницы + 1, ЭтотОбъект.КоличествоСтраниц);
	ТекущийИндексСтраницы = НовыйИндекс;
	ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтроку(Команда)

	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;

	СтрокаИсходная = Элементы.Проверки.ТекущиеДанные;
	Строка = Объект.Проверки.Добавить();
	Строка.ЭтоНоваяСтрока = Истина;
	ЗаполнитьЗначенияСвойств(Строка, СтрокаИсходная, "ТехнологическоеМесто, ОбъектЭксплуатации, УзелОбъектаЭксплуатации");
	ОткрытьФормуРедактирования(Строка);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтроку(Команда)

	Строка = Элементы.Проверки.ТекущиеДанные;
	Строка.ЭтоНоваяСтрока = Ложь;
	ОткрытьФормуРедактирования(Строка);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)

	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	ИндексСтроки = Элементы.Проверки.ТекущиеДанные.НомерСтроки - 1;
	Объект.Проверки.Удалить(ИндексСтроки);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПроверку(Команда)

	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Строка = Объект.Проверки.Добавить();
	Строка.ЭтоНоваяСтрока = Истина;

	ОткрытьФормуРедактирования(Строка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуРедактирования(Строка)
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("НомерСтроки", Строка.ПолучитьИдентификатор());
	ДанныеСтроки.Вставить("ТехнологическоеМесто", Строка.ТехнологическоеМесто);
	ДанныеСтроки.Вставить("ОбъектЭксплуатации", Строка.ОбъектЭксплуатации);
	ДанныеСтроки.Вставить("УзелОбъектаЭксплуатации", Строка.УзелОбъектаЭксплуатации);
	ДанныеСтроки.Вставить("ВидПроверки", Строка.ВидПроверки);
	ДанныеСтроки.Вставить("Комментарий", Строка.Комментарий);
	ДанныеСтроки.Вставить("РезультатПроверки", Строка.РезультатПроверки);
	ДанныеСтроки.Вставить("ТолькоПросмотр", ЭтотОбъект.ТолькоПросмотр);

	ОткрытьФорму("Документ.мп_РегистрацияПроверокОборудования.Форма.ФормаСтрокиПроверки",
		ДанныеСтроки, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаСервере
Процедура ЧтениеНаСервере()

	Проверки = РеквизитыТаблицыПроверки(Объект.Проверки);
	
	Если Не Проверки = Неопределено Тогда
		
		Для Каждого ТекПроверка Из Объект.Проверки Цикл
			Если ЗначениеЗаполнено(ТекПроверка.УзелОбъектаЭксплуатации) Тогда
				ТекПроверка.ТехнологическоеМесто = Проверки.Найти(ТекПроверка.УзелОбъектаЭксплуатации).ТехнологическоеМесто;
				ТекПроверка.ОбъектЭксплуатации = Проверки.Найти(ТекПроверка.УзелОбъектаЭксплуатации).ОбъектЭксплуатации;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитыТаблицыПроверки(Знач Проверки)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗПроверки.УзелОбъектаЭксплуатации КАК УзелОбъектаЭксплуатации
	|ПОМЕСТИТЬ вт_УзлыОС
	|ИЗ
	|	&ТЗПроверки КАК ТЗПроверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УзлыОбъектовЭксплуатации.Ссылка КАК УзелОбъектаЭксплуатации,
	|	УзлыОбъектовЭксплуатации.Владелец КАК ОбъектЭксплуатации,
	|	ОбъектыЭксплуатации.ТехнологическоеМесто КАК ТехнологическоеМесто
	|ИЗ
	|	вт_УзлыОС КАК вт_УзлыОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УзлыОбъектовЭксплуатации КАК УзлыОбъектовЭксплуатации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
	|			ПО УзлыОбъектовЭксплуатации.Владелец = ОбъектыЭксплуатации.Ссылка
	|		ПО вт_УзлыОС.УзелОбъектаЭксплуатации = УзлыОбъектовЭксплуатации.Ссылка";
	
	Запрос.УстановитьПараметр("ТЗПроверки", Проверки.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить();
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция ЕстьДублиДанныхСтроки(Знач Проверки, ТекстОшибки)

	ТЗПроверки = Проверки.Выгрузить();
	
	Если ТЗПроверки.Количество() < 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗПроверки.ИсходныйНомерСтроки КАК ИсходныйНомерСтроки,
	|	ТЗПроверки.НомерСтроки КАК НомерСтроки,
	|	ТЗПроверки.УзелОбъектаЭксплуатации КАК УзелОбъектаЭксплуатации,
	|	ТЗПроверки.ВидПроверки КАК ВидПроверки,
	|	ТЗПроверки.Комментарий КАК Комментарий,
	|	ТЗПроверки.РезультатПроверки КАК РезультатПроверки,
	|	1 КАК КоличествоПовторов
	|ПОМЕСТИТЬ вт_Проверки
	|ИЗ
	|	&ТЗПроверки КАК ТЗПроверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Проверки.УзелОбъектаЭксплуатации КАК УзелОбъектаЭксплуатации,
	|	вт_Проверки.ВидПроверки КАК ВидПроверки,
	|	СУММА(вт_Проверки.КоличествоПовторов) КАК КоличествоПовторов
	|ПОМЕСТИТЬ вт_дубли
	|ИЗ
	|	вт_Проверки КАК вт_Проверки
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_Проверки.УзелОбъектаЭксплуатации,
	|	вт_Проверки.ВидПроверки
	|
	|ИМЕЮЩИЕ
	|	СУММА(вт_Проверки.КоличествоПовторов) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Проверки.НомерСтроки КАК НомерСтроки,
	|	вт_Проверки.УзелОбъектаЭксплуатации КАК УзелОбъектаЭксплуатации,
	|	вт_Проверки.ВидПроверки КАК ВидПроверки
	|ИЗ
	|	вт_Проверки КАК вт_Проверки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_дубли КАК вт_дубли
	|		ПО (вт_дубли.УзелОбъектаЭксплуатации = вт_Проверки.УзелОбъектаЭксплуатации)
	|			И (вт_дубли.ВидПроверки = вт_Проверки.ВидПроверки)";

	Запрос.УстановитьПараметр("ТЗПроверки", ТЗПроверки);
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Ложь;
		
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
		ТекстОшибки = СтрШаблон(
			"В строке %1 узел %2 по виду проверки %3 дубль строки", 
			Выборка.НомерСтроки, Выборка.УзелОбъектаЭксплуатации, Выборка.ВидПроверки);

	Возврат Истина;

КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекстОшибки = "";
	Если ЕстьДублиДанныхСтроки(Объект.Проверки, ТекстОшибки) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокТекущейСтраницы(ТекущийИндексСтраницы)
	ИмяСтраницы = ИменаСтраниц[ТекущийИндексСтраницы];
	Страница = Элементы.Найти(ИмяСтраницы);
	Если Страница = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.ПредставлениеСтраницы.Заголовок = Страница.Заголовок;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Страница;
	ЗаголовокГруппыСтраниц = СтрШаблон("Всего: %1 этапа", ЭтотОбъект.КоличествоСтраниц + 1);
	Элементы.ГруппаКнопкиСтраниц.Заголовок = ЗаголовокГруппыСтраниц;
КонецПроцедуры

#КонецОбласти
